Revit 2027 API
BuiltInFailures.ElectricalFailures.SecondaryNumOfPhasesNotEqualWithPrimary Property
 Number of Phases of the secondary distribution system isn't equal with the primary distribution system's
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SecondaryNumOfPhasesNotEqualWithPrimary { get; }
Public Shared ReadOnly Property SecondaryNumOfPhasesNotEqualWithPrimary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SecondaryNumOfPhasesNotEqualWithPrimary {
	FailureDefinitionId^ get ();
}
static member SecondaryNumOfPhasesNotEqualWithPrimary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace